Revit 2027 API
DocumentType Enumeration
 Types of Revit documents.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DocumentType
Public Enumeration DocumentType
public enum class DocumentType
type DocumentType
Members
Member name | Value | Description
BuildingComponent | 4 |  Building Component document.
Family | 1 |  Family document.
IFC | 3 |  IFC document.
Other | 100 |  Document of another type.
Project | 0 |  Project document.
Template | 2 |  Template document.
See Also
Reference
Autodesk.Revit.DB Namespace